<%@ Page Title="" Language="C#" MasterPageFile="~/Site1.Master" AutoEventWireup="true" CodeBehind="develop.aspx.cs" Inherits="massive_code.develop" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
    <style type="text/css">
    .auto-style52 {
            width: 68px;
        }
    .auto-style53 {
        font-size: x-large;
    }
        .auto-style55 {
            width: 1240px;
            font-family: "Times New Roman";
            color: #006699;
        }
    </style>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <table style="width: 100%;">
    <tr>
        <td class="auto-style52">&nbsp;</td>
        <td class="auto-style55">&nbsp;</td>
        <td>&nbsp;</td>
    </tr>
    <tr>
        <td class="auto-style52">&nbsp;</td>
        <td class="auto-style55">
           
            Решение создать что то, точнее разработать пришло ко мне довольно давно. Приблизительно в 2014 году. Тогда я еще работал в Управлении образования в родном городе, и мне жизненно необходимо было заняться чем то более конструктивным нежели обычный ремонт компьютеров либо настройка программ для рядовых пользователей. Выбор пал на разработку на высокоуровневом языке программирования C#. Изучал я его довольно давно, думаю около 5 лет, абсолютно самостоятельно, используя лишь купленные учебники и горы литературы скачанные мною из огромного множества сайтов с тематикой разработки. Кстати я никогда не любил все эти технические термины. Возможно я покажусь немного странным но я постараюсь использовать всяческие определения в минимуме а описать ход разработки более красочно и скорее в художественной чем технической манере написания. Почему так? Потому что я не считаю себя тем программистом – разработчиком стереотип которого представляется у каждого. Я считаю себя больше художником, создающим 
            нечто подобное прекрасной картине и словно палитрой красок, мазок за мазком я пишу свой неповторимый образ который вдохновляет меня на все новые и новые поступки. Хотя некоторые и усмехнуться возможно сказав, что это лишь просто код, набор цифр и символов перемешанных и в итоге превращенных в нечто одно. Некий образ, кульминационный момент, когда то что ты сотворил словно оживает перед тобой и после многих часов, дней или месяцев работы становиться чем-то прекрасным. Словно создавая статую, ты начинаешь с простой идеи, которая крутилась в твоей голове уже довольно давно и с огромным желанием воплотить это в жизнь берешь в руки глину и инструменты, начинаешь творить. С начала это лишь идея, в уме обрастая все новыми и новыми слоями она представляется тебе колоссом взглядом, устремляющимся далеко в горизонт, способным огромными плечами своими подпирать небеса. С вылепленным из золота лавровым венком он как древнегреческий титан из белого мрамора восстает перед тобой. Ты представляешь 
            все это как будешь стоять возле своего создания с улыбкой и слезами, переполненный счастьем проводить руками по холодному камню и не чувствовать изъянов, ни одной трещины и уголка. Он идеален. И люди восхищаются им, тобой, с каждым днем их становиться все больше и этот гул из аплодисментов разноситься далеко в даль. Ты осознаешь, что сделал что-то в своей жизни, достойное похвалы и тебя уже не забудут. Но проходит миг и опустив свой взгляд ты понимаешь, что резко и стремительно начинаешь падать. Титан казалось бы неразрушимый начинает прогибаться под собственной тяжестью, и ты замечаешь, как в его плечах появляются сначала едва различимые, а затем уже отчетливо видимые трещины, мгновенно превращающиеся в черные зияющие дыры. Минуту назад горделиво стоящий титан падает на колени и начинает осыпаться. Золото что блестело под лучами солнца начинает тускнеть и рассыпаться превращаясь в пепел. Кусок за куском мрамор откалывается и гигант становиться обычной грудой камней.
           
        </td>
        <td>&nbsp;</td>
    </tr>
    <tr>
        <td class="auto-style52">&nbsp;</td>
        <td class="auto-style55">&nbsp;</td>
        <td>&nbsp;</td>
    </tr>
</table>
</asp:Content>
